AlmAck/svdtonuttx/demo/h/da1470x_i3c.h
#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE4_LOC1 Register */

#define I3C_LSB_PROVISIONAL_ID_MASK                     (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define I3C_LSB_PROVISIONAL_ID_POS                      (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE4_LOC2 Register */

#define I3C_MSB_PROVISIONAL_ID_MASK                     (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define I3C_MSB_PROVISIONAL_ID_POS                      (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE4_LOC3 Register */

#define I3C_BCR_MASK                                    (0xFF << 8) /* Bus Characteristic Value */
#define I3C_BCR_POS                                     (8) /* Bus Characteristic Value */
#define I3C_DCR_MASK                                    (0xFF << 0) /* Device Characteristic Value */
#define I3C_DCR_POS                                     (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE4_LOC4 Register */

#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE5_LOC1 Register */

#define I3C_LSB_PROVISIONAL_ID_MASK                     (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define I3C_LSB_PROVISIONAL_ID_POS                      (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE5_LOC2 Register */

#define I3C_MSB_PROVISIONAL_ID_MASK                     (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define I3C_MSB_PROVISIONAL_ID_POS                      (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE5_LOC3 Register */

#define I3C_BCR_MASK                                    (0xFF << 8) /* Bus Characteristic Value */
#define I3C_BCR_POS                                     (8) /* Bus Characteristic Value */
#define I3C_DCR_MASK                                    (0xFF << 0) /* Device Characteristic Value */
#define I3C_DCR_POS                                     (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE5_LOC4 Register */

#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE6_LOC1 Register */

#define I3C_LSB_PROVISIONAL_ID_MASK                     (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define I3C_LSB_PROVISIONAL_ID_POS                      (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE6_LOC2 Register */

#define I3C_MSB_PROVISIONAL_ID_MASK                     (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define I3C_MSB_PROVISIONAL_ID_POS                      (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE6_LOC3 Register */

#define I3C_BCR_MASK                                    (0xFF << 8) /* Bus Characteristic Value */
#define I3C_BCR_POS                                     (8) /* Bus Characteristic Value */
#define I3C_DCR_MASK                                    (0xFF << 0) /* Device Characteristic Value */
#define I3C_DCR_POS                                     (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE6_LOC4 Register */

#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE7_LOC1 Register */

#define I3C_LSB_PROVISIONAL_ID_MASK                     (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define I3C_LSB_PROVISIONAL_ID_POS                      (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE7_LOC2 Register */

#define I3C_MSB_PROVISIONAL_ID_MASK                     (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define I3C_MSB_PROVISIONAL_ID_POS                      (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE7_LOC3 Register */

#define I3C_BCR_MASK                                    (0xFF << 8) /* Bus Characteristic Value */
#define I3C_BCR_POS                                     (8) /* Bus Characteristic Value */
#define I3C_DCR_MASK                                    (0xFF << 0) /* Device Characteristic Value */
#define I3C_DCR_POS                                     (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE7_LOC4 Register */

#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE8_LOC1 Register */

#define I3C_LSB_PROVISIONAL_ID_MASK                     (0xFFFFFFFF << 0) /* The LSB 32-bit value of Provisional-ID */
#define I3C_LSB_PROVISIONAL_ID_POS                      (0) /* The LSB 32-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE8_LOC2 Register */

#define I3C_MSB_PROVISIONAL_ID_MASK                     (0xFFFF << 0) /* The MSB 16-bit value of Provisional-ID */
#define I3C_MSB_PROVISIONAL_ID_POS                      (0) /* The MSB 16-bit value of Provisional-ID */

/* I3C_DEV_CHAR_TABLE8_LOC3 Register */

#define I3C_BCR_MASK                                    (0xFF << 8) /* Bus Characteristic Value */
#define I3C_BCR_POS                                     (8) /* Bus Characteristic Value */
#define I3C_DCR_MASK                                    (0xFF << 0) /* Device Characteristic Value */
#define I3C_DCR_POS                                     (0) /* Device Characteristic Value */

/* I3C_DEV_CHAR_TABLE8_LOC4 Register */

