AlmAck/svdtonuttx/demo/h/da1470x_i3c.h
#define I3C_DEV_DYNAMIC_ADDR_LOC4_MASK                  (0xFF << 0) /* Device Dynamic Address assigned. */
#define I3C_DEV_DYNAMIC_ADDR_LOC4_POS                   (0) /* Device Dynamic Address assigned. */

/* I3C_DEV_CHAR_TABLE_POINTER Register */

#define I3C_PRESENT_DEV_CHAR_TABLE_INDX_MASK            (0x7 << 19) /* Current index of Device Characteristics Table.  This field returns the current l */
#define I3C_PRESENT_DEV_CHAR_TABLE_INDX_POS             (19) /* Current index of Device Characteristics Table.  This field returns the current l */
#define I3C_DEV_CHAR_TABLE_DEPTH_MASK                   (0x7F << 12) /* Depth of Device Characteristics Table */
#define I3C_DEV_CHAR_TABLE_DEPTH_POS                    (12) /* Depth of Device Characteristics Table */
#define I3C_P_DEV_CHAR_TABLE_START_ADDR_MASK            (0xFFF << 0) /* Start Address of Device Characteristics Table. */
#define I3C_P_DEV_CHAR_TABLE_START_ADDR_POS             (0) /* Start Address of Device Characteristics Table. */

/* I3C_HW_CAPABILITY Register */

#define I3C_SLV_IBI_CAP                                 (1U << 19) /* Reflects the IC_SLV_IBI Configurable Parameter.  Specifies slave's capability to */
#define I3C_SLV_HJ_CAP                                  (1U << 18) /* Reflects the IC_SLV_HJ Configurable Parameter.  Specifies slave's capability to  */
#define I3C_DMA_EN                                      (1U << 17) /* Reflects the IC_HAS_DMA Configurable Parameter.  Specifies whether controller is */
#define I3C_HDR_TX_CLOCK_PERIOD_MASK                    (0x3F << 11) /* Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
#define I3C_HDR_TX_CLOCK_PERIOD_POS                     (11) /* Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter. */
#define I3C_CLOCK_PERIOD_MASK                           (0x3F << 5) /* Reflects the IC_CLK_PERIOD Configurable Parameter */
#define I3C_CLOCK_PERIOD_POS                            (5) /* Reflects the IC_CLK_PERIOD Configurable Parameter */
#define I3C_HDR_TS_EN                                   (1U << 4) /* Reflects the IC_SPEED_HDR_TS Configurable Parameter.  Specifies the Controllers  */
#define I3C_HDR_DDR_EN                                  (1U << 3) /* Reflects the IC_SPEED_HDR_DDR Configurable Parameter.  Specifies the Controllers */
#define I3C_DEVICE_ROLE_CONFIG_MASK                     (0x7 << 0) /* Reflects the IC_DEVICE_ROLE Configurable Parameter.  Specifies the configured ro */
#define I3C_DEVICE_ROLE_CONFIG_POS                      (0) /* Reflects the IC_DEVICE_ROLE Configurable Parameter.  Specifies the configured ro */

/* I3C_IBI_QUEUE_CTRL Register */

#define I3C_NOTIFY_SIR_REJECTED                         (1U << 3) /* Notify Rejected Slave Interrupt Request Control.  This bit is used to suppress r */
#define I3C_NOTIFY_HJ_REJECTED                          (1U << 0) /* Notify Rejected Hot-Join Control.  This bit is used to suppress reporting to the */

/* I3C_IBI_QUEUE_STATUS_DATA Register */

#define I3C_IBI_STS_MASK                                (0xF << 28) /* IBI Received Status.  Defines the master response for IBI received.  4'b0xxx: Re */
#define I3C_IBI_STS_POS                                 (28) /* IBI Received Status.  Defines the master response for IBI received.  4'b0xxx: Re */
#define I3C_IBI_ID_MASK                                 (0xFF << 8) /* IBI Identifier.  The byte received after START which includes the address and th */
#define I3C_IBI_ID_POS                                  (8) /* IBI Identifier.  The byte received after START which includes the address and th */
#define I3C_DATA_LENGTH_MASK                            (0xFF << 0) /* In-Band Interrupt data length.  This field represents the length of data receive */
#define I3C_DATA_LENGTH_POS                             (0) /* In-Band Interrupt data length.  This field represents the length of data receive */

/* I3C_IBI_SIR_REQ_REJECT Register */

#define I3C_SIR_REQ_REJECT_MASK                         (0xFFFFFFFF << 0) /* In-band Slave Interrupt Request Reject.  The application of the i3c can decide w */
#define I3C_SIR_REQ_REJECT_POS                          (0) /* In-band Slave Interrupt Request Reject.  The application of the i3c can decide w */

/* I3C_INTR_FORCE Register */

#define I3C_TRANSFER_ERR_FORCE_EN                       (1U << 9) /* Transfer Error Force Enable */
#define I3C_TRANSFER_ABORT_FORCE_EN                     (1U << 5) /* Transfer Abort Force Enable.  This field is used only in master mode of operatio */
#define I3C_RESP_READY_FORCE_EN                         (1U << 4) /* Response Queue Ready Force Enable */
#define I3C_CMD_QUEUE_READY_FORCE_EN                    (1U << 3) /* Command Queue Ready Force Enable */
#define I3C_IBI_THLD_FORCE_EN                           (1U << 2) /* IBI Buffer Threshold Force Enable.  This field is used only in master mode of op */
#define I3C_RX_THLD_FORCE_EN                            (1U << 1) /* Receive Buffer Threshold Force Enable */
#define I3C_TX_THLD_FORCE_EN                            (1U << 0) /* Transmit Buffer Threshold Force Enable. */

/* I3C_INTR_SIGNAL_EN Register */

#define I3C_TRANSFER_ERR_SIGNAL_EN                      (1U << 9) /* Transfer Error Signal Enable */
#define I3C_TRANSFER_ABORT_SIGNAL_EN                    (1U << 5) /* Transfer Abort Signal Enable.  This field is used only in master mode of operati */
#define I3C_RESP_READY_SIGNAL_EN                        (1U << 4) /* Response Queue Ready Signal Enable */
#define I3C_CMD_QUEUE_READY_SIGNAL_EN                   (1U << 3) /* Command Queue Ready Signal Enable */
#define I3C_IBI_THLD_SIGNAL_EN                          (1U << 2) /* IBI Buffer Threshold Signal Enable.  This field is used only in master mode of o */
#define I3C_RX_THLD_SIGNAL_EN                           (1U << 1) /* Receive Buffer Threshold Signal Enable */
#define I3C_TX_THLD_SIGNAL_EN                           (1U << 0) /* Transmit Buffer Threshold Signal Enable.  *Note: For the deassertion of the inte */

