AlmAck/svdtonuttx/demo/h/da1470x_i3c.h
/* I3C_INTR_STATUS_EN Register */

#define I3C_TRANSFER_ERR_STS_EN                         (1U << 9) /* Transfer Error Status Enable */
#define I3C_TRANSFER_ABORT_STS_EN                       (1U << 5) /* Transfer Abort Status Enable.  This field is used only in master mode of operati */
#define I3C_RESP_READY_STS_EN                           (1U << 4) /* Response Queue Ready Status Enable */
#define I3C_CMD_QUEUE_READY_STS_EN                      (1U << 3) /* Command Queue Ready Status Enable */
#define I3C_IBI_THLD_STS_EN                             (1U << 2) /* IBI Buffer Threshold Status Enable.  This field is used only in master mode of o */
#define I3C_RX_THLD_STS_EN                              (1U << 1) /* Receive Buffer Threshold Status Enable */
#define I3C_TX_THLD_STS_EN                              (1U << 0) /* Transmit Buffer Threshold Status Enable */

/* I3C_INTR_STATUS Register */

#define I3C_TRANSFER_ERR_STS                            (1U << 9) /* Transfer Error Status.  This interrupt is generated if any error occurs during t */
#define I3C_TRANSFER_ABORT_STS                          (1U << 5) /* Transfer Abort Status.  This field is used only in master mode of operation.  Th */
#define I3C_RESP_READY_STS                              (1U << 4) /* Response Queue Ready Status.  This interrupt is generated when number of entries */
#define I3C_CMD_QUEUE_READY_STS                         (1U << 3) /* Command Queue Ready.  This interrupt is generated when number of empty locations */
#define I3C_IBI_THLD_STS                                (1U << 2) /* IBI Buffer Threshold Status.  This field is only used in master mode of operatio */
#define I3C_RX_THLD_STS                                 (1U << 1) /* Receive Buffer Threshold Status.  This interrupt is generated when number of ent */
#define I3C_TX_THLD_STS                                 (1U << 0) /* Transmit Buffer Threshold Status.  This interrupt is generated when number of em */

/* I3C_PRESENT_STATE Register */

#define I3C_MASTER_IDLE                                 (1U << 28) /* This field reflects whether the Master Controller is in Idle state or not. This  */
#define I3C_CMD_TID_MASK                                (0xF << 24) /* This field reflects the Transaction-ID of the current executing command. */
#define I3C_CMD_TID_POS                                 (24) /* This field reflects the Transaction-ID of the current executing command. */
#define I3C_CM_TFR_ST_STS_MASK                          (0x3F << 16) /* Current Master Transfer State Status.  Indicates the state of current transfer c */
#define I3C_CM_TFR_ST_STS_POS                           (16) /* Current Master Transfer State Status.  Indicates the state of current transfer c */
#define I3C_CM_TFR_STS_MASK                             (0x3F << 8) /* Transfer Type Status.  Indicates the type of transfer currently executing by the */
#define I3C_CM_TFR_STS_POS                              (8) /* Transfer Type Status.  Indicates the type of transfer currently executing by the */
#define I3C_CURRENT_MASTER                              (1U << 2) /* This Bit is used to check whether the Master is Current Master or not. The Curre */
#define I3C_SDA_LINE_SIGNAL_LEVEL                       (1U << 1) /* This bit is used to check the SDA line level to recover from errors and for debu */
#define I3C_SCL_LINE_SIGNAL_LEVEL                       (1U << 0) /* This bit is used to check the SCL line level to recover from errors and for debu */

/* I3C_QUEUE_SIZE_CAPABILITY Register */

#define I3C_IBI_BUF_SIZE_MASK                           (0xF << 16) /* IBI Queue Size  This field reflects the configured IBI Queue size (in DWORDS) in */
#define I3C_IBI_BUF_SIZE_POS                            (16) /* IBI Queue Size  This field reflects the configured IBI Queue size (in DWORDS) in */
#define I3C_RESP_BUF_SIZE_MASK                          (0xF << 12) /* Response Queue Size  This field reflects the configured Response Queue size (in  */
#define I3C_RESP_BUF_SIZE_POS                           (12) /* Response Queue Size  This field reflects the configured Response Queue size (in  */
#define I3C_CMD_BUF_SIZE_MASK                           (0xF << 8) /* Command Queue Size  This field reflects the configured Command Queue size (in DW */
#define I3C_CMD_BUF_SIZE_POS                            (8) /* Command Queue Size  This field reflects the configured Command Queue size (in DW */
#define I3C_RX_BUF_SIZE_MASK                            (0xF << 4) /* Receive Data Buffer Size  This field reflects the configured Receive Buffer size */
#define I3C_RX_BUF_SIZE_POS                             (4) /* Receive Data Buffer Size  This field reflects the configured Receive Buffer size */
#define I3C_TX_BUF_SIZE_MASK                            (0xF << 0) /* Transmit Data Buffer Size  This field reflects the configured Transmit Buffer si */
#define I3C_TX_BUF_SIZE_POS                             (0) /* Transmit Data Buffer Size  This field reflects the configured Transmit Buffer si */

/* I3C_QUEUE_STATUS_LEVEL Register */

#define I3C_IBI_STS_CNT_MASK                            (0x1F << 24) /* IBI Buffer Status Count.  Contains the number of IBI status entries in the IBI B */
#define I3C_IBI_STS_CNT_POS                             (24) /* IBI Buffer Status Count.  Contains the number of IBI status entries in the IBI B */
#define I3C_IBI_BUF_BLR_MASK                            (0xFF << 16) /* IBI Buffer Level Value.  Contains the number of valid entries in the IBI Buffer. */
#define I3C_IBI_BUF_BLR_POS                             (16) /* IBI Buffer Level Value.  Contains the number of valid entries in the IBI Buffer. */
#define I3C_RESP_BUF_BLR_MASK                           (0xFF << 8) /* Response Buffer Level Value.  Contains the number of valid data entries in the r */
#define I3C_RESP_BUF_BLR_POS                            (8) /* Response Buffer Level Value.  Contains the number of valid data entries in the r */
#define I3C_CMD_QUEUE_EMPTY_LOC_MASK                    (0xFF << 0) /* Command Queue Empty Locations.  Contains the number of empty locations in the co */
#define I3C_CMD_QUEUE_EMPTY_LOC_POS                     (0) /* Command Queue Empty Locations.  Contains the number of empty locations in the co */

